Revit 2027 API
RebarCoupler.GetCouplerQuantity Method
 Identifies the number of couplers in a set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetCouplerQuantity()
Public Function GetCouplerQuantity As Integer
public:
int GetCouplerQuantity()
member GetCouplerQuantity : unit -> int
Return Value
Int32
 Returns the number of couplers in a set.
See Also
Reference
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace